tiborsimon/embedded-tdd-headers/pic/8bit/pic18c452_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18C452_H_
#define _PIC18C452_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFM                         8
#define AN3                           9
#define PORTA_RA3                     10
#define VREFP                         11
#define PORTA_RA4                     12
#define T0CKI                         13
#define AN4                           14
#define PORTA_RA5                     15
#define LVDIN                         16
#define SS                            17
#define CLKOUT                        18
#define CLKO                          19
#define PORTA_RA6                     20
#define OSC2                          21
#define PORTB                         22
#define PORTB_RB0                     23
#define INT0                          24
#define PORTB_RB1                     25
#define INT1                          26
#define INT2                          27
#define PORTB_RB2                     28
#define CCP2_PA2                      29
#define PORTB_CCP2                    30
#define CCP2A                         31
#define PORTB_RB3                     32
#define PORTB_RB4                     33
#define PORTB_RB5                     34
#define PORTB_RB6                     35
#define PORTB_RB7                     36
#define PORTC                         37
#define T1CKI                         38
#define T1OSO                         39
#define PORTC_RC0                     40
#define PORTC_CCP2                    41
#define T1OSI                         42
#define PA2                           43
#define PORTC_RC1                     44
#define CCP1                          45
#define PA1                           46
#define PORTC_RC2                     47
#define SCL                           48
#define SCK                           49
#define PORTC_RC3                     50
#define SDA                           51
#define SDI                           52
#define PORTC_RC4                     53
#define SDO                           54
#define PORTC_RC5                     55
#define TX                            56
#define CK                            57
#define PORTC_RC6                     58
#define DT                            59
#define RX                            60
#define PORTC_RC7                     61
#define PORTD                         62
#define PORTD_RD0                     63
#define PSP0                          64
#define PORTD_RD1                     65
#define PSP1                          66
#define PORTD_RD2                     67
#define PSP2                          68
#define PORTD_RD3                     69
#define PSP3                          70
#define PORTD_RD4                     71
#define PSP4                          72
#define PORTD_RD5                     73
#define PSP5                          74
#define PORTD_RD6                     75
#define PSP6                          76
#define PORTD_RD7                     77
#define SS2                           78
#define PSP7                          79
#define PORTE                         80
#define RDE                           81
#define PD2                           82
#define RD                            83
#define AN5                           84
#define PORTE_RE0                     85
#define WRE                           86
#define AN6                           87
#define WR                            88
#define PC2                           89
#define PORTE_RE1                     90
#define CCP10                         91
#define PB2                           92
#define PORTE_RE2                     93
#define AN7                           94
#define CS                            95
#define LATA                          96
#define LATA0                         97
#define LA0                           98
#define LATA1                         99
#define LA1                           100
#define LATA2                         101
#define LA2                           102
#define LATA3                         103
#define LA3                           104
#define LATA4                         105
#define LA4                           106
#define LATA5                         107
#define LA5                           108
#define LATA6                         109
#define LA6                           110
#define LATB                          111
#define LB0                           112
#define LATB0                         113
#define LB1                           114
#define LATB1                         115
#define LB2                           116
#define LATB2                         117
#define LB3                           118
#define LATB3                         119
#define LB4                           120
#define LATB4                         121
#define LB5                           122
#define LATB5                         123
#define LB6                           124
#define LATB6                         125
#define LB7                           126
#define LATB7                         127
#define LATC                          128
#define LATC0                         129
#define LC0                           130
#define LATC1                         131
#define LC1                           132
#define LATC2                         133
#define LC2                           134
#define LATC3                         135
#define LC3                           136
#define LATC4                         137
#define LC4                           138
#define LATC5                         139
#define LC5                           140
#define LATC6                         141
#define LC6                           142
#define LATC7                         143
#define LC7                           144
#define LATD                          145
#define LATD0                         146
#define LD0                           147
#define LATD1                         148
#define LD1                           149
#define LATD2                         150
#define LD2                           151
#define LATD3                         152
#define LD3                           153
#define LATD4                         154
#define LD4                           155
#define LATD5                         156
#define LD5                           157
#define LATD6                         158
#define LD6                           159
#define LATD7                         160
#define LD7                           161
#define LATE                          162
#define LATE0                         163
#define LE0                           164
#define LATE1                         165
#define LE1                           166
#define LATE2                         167
#define LE2                           168
#define TRISA                         169
#define TRISA_RA0                     170
#define TRISA0                        171
#define TRISA_RA1                     172
#define TRISA1                        173
#define TRISA2                        174
#define TRISA_RA2                     175
#define TRISA_RA3                     176
#define TRISA3                        177
#define TRISA_RA4                     178
#define TRISA4                        179
#define TRISA_RA5                     180
#define TRISA5                        181
#define TRISA_RA6                     182
#define TRISA6                        183
#define TRISB                         184
#define TRISB_RB0                     185
#define TRISB0                        186
#define TRISB_RB1                     187
#define TRISB1                        188
#define TRISB_RB2                     189
#define TRISB2                        190
#define TRISB_RB3                     191
#define TRISB3                        192
#define TRISB_RB4                     193
#define TRISB4                        194
#define TRISB_RB5                     195
#define TRISB5                        196
#define TRISB_RB6                     197
#define TRISB6                        198
#define TRISB_RB7                     199
#define TRISB7                        200
#define TRISC                         201
#define TRISC0                        202
#define TRISC_RC0                     203
#define TRISC1                        204
#define TRISC_RC1                     205
#define TRISC2                        206
#define TRISC_RC2                     207
#define TRISC3                        208
#define TRISC_RC3                     209
#define TRISC4                        210
#define TRISC_RC4                     211
#define TRISC5                        212
#define TRISC_RC5                     213
#define TRISC6                        214
#define TRISC_RC6                     215
#define TRISC7                        216
#define TRISC_RC7                     217
#define TRISD                         218
#define TRISD_RD0                     219
#define TRISD0                        220
#define TRISD_RD1                     221
#define TRISD1                        222
#define TRISD_RD2                     223
#define TRISD2                        224
#define TRISD_RD3                     225
#define TRISD3                        226
#define TRISD_RD4                     227
#define TRISD4                        228
#define TRISD_RD5                     229
#define TRISD5                        230
#define TRISD_RD6                     231
#define TRISD6                        232
#define TRISD_RD7                     233
#define TRISD7                        234
#define TRISE                         235
#define TRISE_RE0                     236
#define TRISE0                        237
#define TRISE_RE1                     238
#define TRISE1                        239
#define TRISE_RE2                     240
#define TRISE2                        241
#define PSPMODE                       242
#define IBOV                          243
#define OBF                           244
#define IBF                           245
#define PIE1                          246
#define TMR1IE                        247
#define TMR2IE                        248
#define CCP1IE                        249
#define SSPIE                         250
#define TXIE                          251
#define TX1IE                         252
#define RCIE                          253
#define RC1IE                         254
#define ADIE                          255
#define PSPIE                         256
#define PIR1                          257
#define TMR1IF                        258
#define TMR2IF                        259
#define CCP1IF                        260
#define SSPIF                         261
#define TXIF                          262
#define TX1IF                         263
#define RCIF                          264
#define RC1IF                         265
#define ADIF                          266
#define PSPIF                         267
#define IPR1                          268
#define TMR1IP                        269
#define TMR2IP                        270
#define CCP1IP                        271
#define SSPIP                         272
#define TX1IP                         273
#define TXIP                          274
#define RC1IP                         275
#define RCIP                          276
#define ADIP                          277
#define PSPIP                         278
#define PIE2                          279
#define CCP2IE                        280
#define TMR3IE                        281
#define LVDIE                         282
#define BCLIE                         283
#define PIR2                          284
#define CCP2IF                        285
#define TMR3IF                        286
#define LVDIF                         287
#define BCLIF                         288
#define IPR2                          289
#define CCP2IP                        290
#define TMR3IP                        291
#define LVDIP                         292
#define BCLIP                         293
#define RCSTA                         294
#define RCD8                          295
#define RX9D                          296
#define OERR                          297
#define FERR                          298
#define ADDEN                         299
#define CREN                          300
#define SREN                          301
#define SRENA                         302
#define RC8_9                         303
#define RC9                           304
#define RX9                           305
#define nRC8                          306
#define NOT_RC8                       307
#define SPEN                          308
#define TXSTA                         309
#define TXD8                          310
#define TX9D1                         311
#define TX9D                          312
#define TRMT                          313
#define TRMT1                         314
#define BRGH1                         315
#define BRGH                          316
#define SYNC                          317
#define SYNC1                         318
#define TXEN1                         319
#define TXEN                          320
#define TX91                          321
#define TX8_9                         322
#define TX9                           323
#define NOT_TX8                       324
#define nTX8                          325
#define CSRC1                         326
#define CSRC                          327
#define T3CON                         328
#define TMR3ON                        329
#define TMR3CS                        330
#define nT3SYNC                       331
#define NOT_T3SYNC                    332
#define T3SYNC                        333
#define T3INSYNC                      334
#define SOSCEN3                       335
#define T3CCP1                        336
#define T3CKPS                        337
#define T3CKPS0                       338
#define T3CKPS1                       339
#define T3CCP2                        340
#define T3CON_RD16                    341
#define RD163                         342
#define T3RD16                        343
#define CCP2CON                       344
#define CCP2M                         345
#define CCP2M0                        346
#define CCP2M1                        347
#define CCP2M2                        348
#define CCP2M3                        349
#define DC2B0                         350
#define CCP2Y                         351
#define DC2B                          352
#define DC2B1                         353
#define CCP2X                         354
#define CCP1CON                       355
#define CCP1M0                        356
#define CCP1M                         357
#define CCP1M1                        358
#define CCP1M2                        359
#define CCP1M3                        360
#define CCP1Y                         361
#define DC1B                          362
#define DC1B0                         363
#define CCP1X                         364
#define DC1B1                         365
#define ADCON1                        366
#define PCFG0                         367
#define PCFG                          368
#define PCFG1                         369
#define PCFG2                         370
#define CHSN3                         371
#define PCFG3                         372
#define ADCS2                         373
#define ADFM                          374
#define ADCON0                        375
#define ADON                          376
#define nDONE                         377
#define GO_nDONE                      378
#define GO_DONE                       379
#define NOT_DONE                      380
#define GODONE                        381
#define DONE                          382
#define GO                            383
#define GO_NOT_DONE                   384
#define CHS                           385
#define CHS0                          386
#define CHS1                          387
#define CHS2                          388
#define ADCS                          389
#define ADCS0                         390
#define ADCAL                         391
#define ADCS1                         392
#define SSPCON2                       393
#define SEN                           394
#define RSEN                          395
#define PEN                           396
#define RCEN                          397
#define ACKEN                         398
#define ACKDT                         399
#define ACKSTAT                       400
#define GCEN                          401
#define SSPCON1                       402
#define SSPM0                         403
#define SSPM                          404
#define SSPM1                         405
#define SSPM2                         406
#define SSPM3                         407
#define CKP                           408
#define SSPEN                         409
#define SSPOV                         410
#define WCOL                          411
#define SSPSTAT                       412
#define BF                            413
#define UA                            414
#define R_NOT_W                       415
#define READ_WRITE                    416
#define NOT_W                         417
#define R_W                           418
#define RW                            419
#define R                             420
#define NOT_WRITE                     421
#define nW                            422
#define nWRITE                        423
#define R_nW                          424
#define I2C_READ                      425
#define START                         426
#define S                             427
#define I2C_START                     428
#define STOP                          429
#define I2C_STOP                      430
#define P                             431
#define NOT_A                         432
#define I2C_DATA                      433
#define nA                            434
#define D_nA                          435
#define D                             436
#define DA                            437
#define DATA_ADDRESS                  438
#define D_A                           439
#define D_NOT_A                       440
#define NOT_ADDRESS                   441
#define nADDRESS                      442
#define I2C_DAT                       443
#define CKE                           444
#define SMP                           445
#define T2CON                         446
#define T2CKPS0                       447
#define T2CKPS                        448
#define T2CKPS1                       449
#define TMR2ON                        450
#define TOUTPS0                       451
#define TOUTPS                        452
#define TOUTPS1                       453
#define TOUTPS2                       454
#define TOUTPS3                       455
#define PR2                           456
#define WM0                           457
#define WM1                           458
#define WAIT0                         459
#define WAIT1                         460
#define EBDIS                         461
#define T1CON                         462
#define TMR1ON                        463
#define TMR1CS                        464
#define NOT_T1SYNC                    465
#define T1SYNC                        466
#define nT1SYNC                       467
#define T1INSYNC                      468
#define T1OSCEN                       469
#define SOSCEN                        470
#define T1CKPS0                       471
#define T1CKPS                        472
#define T1CKPS1                       473
#define T1RD16                        474
#define T1CON_RD16                    475
#define RCON                          476
#define BOR                           477
#define NOT_BOR                       478
#define nBOR                          479
#define POR                           480
#define nPOR                          481
#define NOT_POR                       482
#define nPD                           483
#define NOT_PD                        484
#define PD                            485
#define TO                            486
#define NOT_TO                        487
#define nTO                           488
#define nRI                           489
#define NOT_RI                        490
#define RI                            491
#define LWRT                          492
#define IPEN                          493
#define WDTCON                        494
#define SWDTE                         495
#define SWDTEN                        496
#define LVDCON                        497
#define LVV0                          498
#define LVDL0                         499
#define LVDL                          500
#define LVV1                          501
#define LVDL1                         502
#define LVV2                          503
#define LVDL2                         504
#define LVV3                          505
#define LVDL3                         506
#define LVDEN                         507
#define BGST                          508
#define IRVST                         509
#define OSCCON                        510
#define SCS                           511
#define T0CON                         512
#define T0PS                          513
#define T0PS0                         514
#define T0PS1                         515
#define T0PS2                         516
#define PSA                           517
#define T0SE                          518
#define T0CS                          519
#define T08BIT                        520
#define TMR0ON                        521
